{"weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"dtype": "float32", "shape": [300, 256], "name": "bidirectional/forward_lstm/lstm_cell_1/kernel"}, {"dtype": "float32", "shape": [64, 256], "name": "bidirectional/forward_lstm/lstm_cell_1/recurrent_kernel"}, {"dtype": "float32", "shape": [256], "name": "bidirectional/forward_lstm/lstm_cell_1/bias"}, {"dtype": "float32", "shape": [300, 256], "name": "bidirectional/backward_lstm/lstm_cell_2/kernel"}, {"dtype": "float32", "shape": [64, 256], "name": "bidirectional/backward_lstm/lstm_cell_2/recurrent_kernel"}, {"dtype": "float32", "shape": [256], "name": "bidirectional/backward_lstm/lstm_cell_2/bias"}, {"dtype": "float32", "shape": [128, 256], "name": "bidirectional_1/forward_lstm_1/lstm_cell_4/kernel"}, {"dtype": "float32", "shape": [64, 256], "name": "bidirectional_1/forward_lstm_1/lstm_cell_4/recurrent_kernel"}, {"dtype": "float32", "shape": [256], "name": "bidirectional_1/forward_lstm_1/lstm_cell_4/bias"}, {"dtype": "float32", "shape": [128, 256], "name": "bidirectional_1/backward_lstm_1/lstm_cell_5/kernel"}, {"dtype": "float32", "shape": [64, 256], "name": "bidirectional_1/backward_lstm_1/lstm_cell_5/recurrent_kernel"}, {"dtype": "float32", "shape": [256], "name": "bidirectional_1/backward_lstm_1/lstm_cell_5/bias"}, {"dtype": "float32", "shape": [128, 64], "name": "dense/kernel"}, {"dtype": "float32", "shape": [64], "name": "dense/bias"}, {"dtype": "float32", "shape": [64, 32], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [32], "name": "dense_1/bias"}, {"dtype": "float32", "shape": [32, 13], "name": "dense_2/kernel"}, {"dtype": "float32", "shape": [13], "name": "dense_2/bias"}, {"dtype": "float32", "shape": [5000, 300], "name": "embedding/embeddings"}]}], "modelTopology": {"training_config": {"metrics": [[{"class_name": "MeanMetricWrapper", "config": {"dtype": "float32", "name": "accuracy", "fn": "sparse_categorical_accuracy"}}]], "loss": {"class_name": "SparseCategoricalCrossentropy", "config": {"reduction": "auto", "from_logits": false, "name": "sparse_categorical_crossentropy", "ignore_class": null}}, "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "name": "Adam", "decay": 0.0, "epsilon": 1e-07, "learning_rate": 0.00010000000474974513, "amsgrad": false}}, "weighted_metrics": null, "loss_weights": null}, "keras_version": "2.11.0", "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "InputLayer", "config": {"ragged": false, "dtype": "float32", "batch_input_shape": [null, 70], "name": "input_2", "sparse": false}}, {"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding", "dtype": "float32", "output_dim": 300, "trainable": false, "embeddings_regularizer": null, "input_dim": 5000, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 70], "activity_regularizer": null, "input_length": 70}}, {"class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d", "dtype": "float32", "trainable": true, "rate": 0.2, "seed": null, "noise_shape": null}}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"recurrent_activation": "sigmoid", "dtype": "float32", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_constraint": null, "time_major": false, "activation": "tanh", "stateful": false, "dropout": 0.2, "recurrent_regularizer": null, "name": "lstm", "bias_constraint": null, "go_backwards": false, "implementation": 2, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}}, "trainable": true, "name": "bidirectional"}}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"recurrent_activation": "sigmoid", "dtype": "float32", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_constraint": null, "time_major": false, "activation": "tanh", "stateful": false, "dropout": 0.0, "recurrent_regularizer": null, "name": "lstm_1", "bias_constraint": null, "go_backwards": false, "implementation": 2, "kernel_regularizer": null, "return_sequences": false, "recurrent_constraint": null}}, "trainable": true, "name": "bidirectional_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout", "dtype": "float32", "trainable": true, "rate": 0.3, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 32, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "dtype": "float32", "trainable": true, "rate": 0.3, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_2", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 13, "use_bias": true, "activity_regularizer": null}}], "name": "sequential"}}, "backend": "tensorflow"}, "generatedBy": "keras v2.11.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "format": "layers-model"}